app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2016-10-24 22:42:01.343478"], ["updated_at", "2016-10-24 22:42:01.343478"]]
---
  def create
    @student = Student.new(student_params(:first_name, :last_name))
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @student= Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-10-24 22:46:43.053232"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name, :last_name))